Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM-GPM-0XX_DFP/1.3.50/include/proc/p32mm0064gpm064.h
extern volatile __CCP8STATbits_t CCP8STATbits __asm__ ("CCP8STAT") __attribute__((section("sfrs"), address(0xBF800830)));
extern volatile uint32_t        CCP8STATCLR __attribute__((section("sfrs"),address(0xBF800834)));
extern volatile uint32_t        CCP8STATSET __attribute__((section("sfrs"),address(0xBF800838)));
extern volatile uint32_t        CCP8STATINV __attribute__((section("sfrs"),address(0xBF80083C)));
#define CCP8TMR CCP8TMR
extern volatile uint32_t   CCP8TMR __attribute__((section("sfrs"), address(0xBF800840)));
typedef union {
  struct {
    uint32_t TMRL:16;
    uint32_t TMRH:16;
  };
  struct {
    uint32_t TMR:32;
  };
} __CCP8TMRbits_t;
extern volatile __CCP8TMRbits_t CCP8TMRbits __asm__ ("CCP8TMR") __attribute__((section("sfrs"), address(0xBF800840)));
extern volatile uint32_t        CCP8TMRCLR __attribute__((section("sfrs"),address(0xBF800844)));
extern volatile uint32_t        CCP8TMRSET __attribute__((section("sfrs"),address(0xBF800848)));
extern volatile uint32_t        CCP8TMRINV __attribute__((section("sfrs"),address(0xBF80084C)));
#define CCP8PR CCP8PR
extern volatile uint32_t   CCP8PR __attribute__((section("sfrs"), address(0xBF800850)));
typedef union {
  struct {
    uint32_t PRL:16;
    uint32_t PRH:16;
  };
  struct {
    uint32_t PR:32;
  };
} __CCP8PRbits_t;
extern volatile __CCP8PRbits_t CCP8PRbits __asm__ ("CCP8PR") __attribute__((section("sfrs"), address(0xBF800850)));
extern volatile uint32_t        CCP8PRCLR __attribute__((section("sfrs"),address(0xBF800854)));
extern volatile uint32_t        CCP8PRSET __attribute__((section("sfrs"),address(0xBF800858)));
extern volatile uint32_t        CCP8PRINV __attribute__((section("sfrs"),address(0xBF80085C)));
#define CCP8RA CCP8RA
extern volatile uint32_t   CCP8RA __attribute__((section("sfrs"), address(0xBF800860)));
typedef struct {
  uint32_t CMPA:16;
} __CCP8RAbits_t;
extern volatile __CCP8RAbits_t CCP8RAbits __asm__ ("CCP8RA") __attribute__((section("sfrs"), address(0xBF800860)));
extern volatile uint32_t        CCP8RACLR __attribute__((section("sfrs"),address(0xBF800864)));
extern volatile uint32_t        CCP8RASET __attribute__((section("sfrs"),address(0xBF800868)));
extern volatile uint32_t        CCP8RAINV __attribute__((section("sfrs"),address(0xBF80086C)));
#define CCP8RB CCP8RB
extern volatile uint32_t   CCP8RB __attribute__((section("sfrs"), address(0xBF800870)));
typedef struct {
  uint32_t CMPB:16;
} __CCP8RBbits_t;
extern volatile __CCP8RBbits_t CCP8RBbits __asm__ ("CCP8RB") __attribute__((section("sfrs"), address(0xBF800870)));
extern volatile uint32_t        CCP8RBCLR __attribute__((section("sfrs"),address(0xBF800874)));
extern volatile uint32_t        CCP8RBSET __attribute__((section("sfrs"),address(0xBF800878)));
extern volatile uint32_t        CCP8RBINV __attribute__((section("sfrs"),address(0xBF80087C)));
#define CCP8BUF CCP8BUF
extern volatile uint32_t   CCP8BUF __attribute__((section("sfrs"), address(0xBF800880)));
typedef union {
  struct {
    uint32_t BUFL:16;
    uint32_t BUFH:16;
  };
  struct {
    uint32_t BUF:32;
  };
} __CCP8BUFbits_t;
extern volatile __CCP8BUFbits_t CCP8BUFbits __asm__ ("CCP8BUF") __attribute__((section("sfrs"), address(0xBF800880)));
extern volatile uint32_t        CCP8BUFCLR __attribute__((section("sfrs"),address(0xBF800884)));
extern volatile uint32_t        CCP8BUFSET __attribute__((section("sfrs"),address(0xBF800888)));
extern volatile uint32_t        CCP8BUFINV __attribute__((section("sfrs"),address(0xBF80088C)));
#define CCP9CON1 CCP9CON1
extern volatile uint32_t   CCP9CON1 __attribute__((section("sfrs"), address(0xBF800900)));
typedef struct {
  uint32_t MOD:4;
  uint32_t CCSEL:1;
  uint32_t T32:1;
  uint32_t TMRPS:2;
  uint32_t CLKSEL:3;
  uint32_t TMRSYNC:1;
  uint32_t CCPSLP:1;
  uint32_t SIDL:1;
  uint32_t :1;
  uint32_t ON:1;
  uint32_t SYNC:5;
  uint32_t ALTSYNC:1;
  uint32_t ONESHOT:1;
  uint32_t TRIGEN:1;
  uint32_t OPS:4;
  uint32_t :2;
  uint32_t RTRGEN:1;
  uint32_t OPSSRC:1;
} __CCP9CON1bits_t;
extern volatile __CCP9CON1bits_t CCP9CON1bits __asm__ ("CCP9CON1") __attribute__((section("sfrs"), address(0xBF800900)));
extern volatile uint32_t        CCP9CON1CLR __attribute__((section("sfrs"),address(0xBF800904)));
extern volatile uint32_t        CCP9CON1SET __attribute__((section("sfrs"),address(0xBF800908)));
extern volatile uint32_t        CCP9CON1INV __attribute__((section("sfrs"),address(0xBF80090C)));
#define CCP9CON2 CCP9CON2
extern volatile uint32_t   CCP9CON2 __attribute__((section("sfrs"), address(0xBF800910)));
typedef struct {
  uint32_t ASDG:8;
  uint32_t :4;
  uint32_t SSDG:1;
  uint32_t :1;
  uint32_t ASDGM:1;
  uint32_t PWMRSEN:1;
  uint32_t ICS:3;
  uint32_t AUXOUT:2;
  uint32_t :1;
  uint32_t ICGSM:2;
  uint32_t OCAEN:1;
  uint32_t :6;
  uint32_t OENSYNC:1;
} __CCP9CON2bits_t;
extern volatile __CCP9CON2bits_t CCP9CON2bits __asm__ ("CCP9CON2") __attribute__((section("sfrs"), address(0xBF800910)));
extern volatile uint32_t        CCP9CON2CLR __attribute__((section("sfrs"),address(0xBF800914)));
extern volatile uint32_t        CCP9CON2SET __attribute__((section("sfrs"),address(0xBF800918)));
extern volatile uint32_t        CCP9CON2INV __attribute__((section("sfrs"),address(0xBF80091C)));
#define CCP9CON3 CCP9CON3
extern volatile uint32_t   CCP9CON3 __attribute__((section("sfrs"), address(0xBF800920)));
typedef struct {
  uint32_t :18;
  uint32_t PSSACE:2;
  uint32_t :1;
  uint32_t POLACE:1;
  uint32_t :6;
  uint32_t OSCNT:3;
  uint32_t OETRIG:1;
} __CCP9CON3bits_t;
extern volatile __CCP9CON3bits_t CCP9CON3bits __asm__ ("CCP9CON3") __attribute__((section("sfrs"), address(0xBF800920)));
extern volatile uint32_t        CCP9CON3CLR __attribute__((section("sfrs"),address(0xBF800924)));
extern volatile uint32_t        CCP9CON3SET __attribute__((section("sfrs"),address(0xBF800928)));
extern volatile uint32_t        CCP9CON3INV __attribute__((section("sfrs"),address(0xBF80092C)));
#define CCP9STAT CCP9STAT
extern volatile uint32_t   CCP9STAT __attribute__((section("sfrs"), address(0xBF800930)));
typedef struct {
  uint32_t ICBNE:1;
  uint32_t ICOV:1;
  uint32_t ICDIS:1;
  uint32_t SCEVT:1;
  uint32_t ASEVT:1;
  uint32_t TRCLR:1;
  uint32_t TRSET:1;
  uint32_t CCPTRIG:1;
  uint32_t :2;
  uint32_t ICGARM:1;
  uint32_t :5;
  uint32_t RAWIP:1;
  uint32_t RBWIP:1;
  uint32_t TMRLWIP:1;
  uint32_t TMRHWIP:1;
  uint32_t PRLWIP:1;
} __CCP9STATbits_t;
