Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM-GPM-0XX_DFP/1.3.50/include/proc/p32mm0064gpm064.h
extern volatile __IPC12bits_t IPC12bits __asm__ ("IPC12") __attribute__((section("sfrs"), address(0xBF80F200)));
extern volatile uint32_t        IPC12CLR __attribute__((section("sfrs"),address(0xBF80F204)));
extern volatile uint32_t        IPC12SET __attribute__((section("sfrs"),address(0xBF80F208)));
extern volatile uint32_t        IPC12INV __attribute__((section("sfrs"),address(0xBF80F20C)));
#define IPC13 IPC13
extern volatile uint32_t   IPC13 __attribute__((section("sfrs"), address(0xBF80F210)));
typedef struct {
  uint32_t :8;
  uint32_t U1RXIS:2;
  uint32_t U1RXIP:3;
  uint32_t :3;
  uint32_t U1TXIS:2;
  uint32_t U1TXIP:3;
  uint32_t :3;
  uint32_t U1EIS:2;
  uint32_t U1EIP:3;
} __IPC13bits_t;
extern volatile __IPC13bits_t IPC13bits __asm__ ("IPC13") __attribute__((section("sfrs"), address(0xBF80F210)));
extern volatile uint32_t        IPC13CLR __attribute__((section("sfrs"),address(0xBF80F214)));
extern volatile uint32_t        IPC13SET __attribute__((section("sfrs"),address(0xBF80F218)));
extern volatile uint32_t        IPC13INV __attribute__((section("sfrs"),address(0xBF80F21C)));
#define IPC14 IPC14
extern volatile uint32_t   IPC14 __attribute__((section("sfrs"), address(0xBF80F220)));
typedef struct {
  uint32_t U2RXIS:2;
  uint32_t U2RXIP:3;
  uint32_t :3;
  uint32_t U2TXIS:2;
  uint32_t U2TXIP:3;
  uint32_t :3;
  uint32_t U2EIS:2;
  uint32_t U2EIP:3;
  uint32_t :3;
  uint32_t U3RXIS:2;
  uint32_t U3RXIP:3;
} __IPC14bits_t;
extern volatile __IPC14bits_t IPC14bits __asm__ ("IPC14") __attribute__((section("sfrs"), address(0xBF80F220)));
extern volatile uint32_t        IPC14CLR __attribute__((section("sfrs"),address(0xBF80F224)));
extern volatile uint32_t        IPC14SET __attribute__((section("sfrs"),address(0xBF80F228)));
extern volatile uint32_t        IPC14INV __attribute__((section("sfrs"),address(0xBF80F22C)));
#define IPC15 IPC15
extern volatile uint32_t   IPC15 __attribute__((section("sfrs"), address(0xBF80F230)));
typedef struct {
  uint32_t U3TXIS:2;
  uint32_t U3TXIP:3;
  uint32_t :3;
  uint32_t U3EIS:2;
  uint32_t U3EIP:3;
} __IPC15bits_t;
extern volatile __IPC15bits_t IPC15bits __asm__ ("IPC15") __attribute__((section("sfrs"), address(0xBF80F230)));
extern volatile uint32_t        IPC15CLR __attribute__((section("sfrs"),address(0xBF80F234)));
extern volatile uint32_t        IPC15SET __attribute__((section("sfrs"),address(0xBF80F238)));
extern volatile uint32_t        IPC15INV __attribute__((section("sfrs"),address(0xBF80F23C)));
#define IPC16 IPC16
extern volatile uint32_t   IPC16 __attribute__((section("sfrs"), address(0xBF80F240)));
typedef struct {
  uint32_t :8;
  uint32_t I2C1SIS:2;
  uint32_t I2C1SIP:3;
  uint32_t :3;
  uint32_t I2C1MIS:2;
  uint32_t I2C1MIP:3;
  uint32_t :3;
  uint32_t I2C1BCIS:2;
  uint32_t I2C1BCIP:3;
} __IPC16bits_t;
extern volatile __IPC16bits_t IPC16bits __asm__ ("IPC16") __attribute__((section("sfrs"), address(0xBF80F240)));
extern volatile uint32_t        IPC16CLR __attribute__((section("sfrs"),address(0xBF80F244)));
extern volatile uint32_t        IPC16SET __attribute__((section("sfrs"),address(0xBF80F248)));
extern volatile uint32_t        IPC16INV __attribute__((section("sfrs"),address(0xBF80F24C)));
#define IPC17 IPC17
extern volatile uint32_t   IPC17 __attribute__((section("sfrs"), address(0xBF80F250)));
typedef struct {
  uint32_t I2C2SIS:2;
  uint32_t I2C2SIP:3;
  uint32_t :3;
  uint32_t I2C2MIS:2;
  uint32_t I2C2MIP:3;
  uint32_t :3;
  uint32_t I2C2BCIS:2;
  uint32_t I2C2BCIP:3;
  uint32_t :3;
  uint32_t I2C3SIS:2;
  uint32_t I2C3SIP:3;
} __IPC17bits_t;
extern volatile __IPC17bits_t IPC17bits __asm__ ("IPC17") __attribute__((section("sfrs"), address(0xBF80F250)));
extern volatile uint32_t        IPC17CLR __attribute__((section("sfrs"),address(0xBF80F254)));
extern volatile uint32_t        IPC17SET __attribute__((section("sfrs"),address(0xBF80F258)));
extern volatile uint32_t        IPC17INV __attribute__((section("sfrs"),address(0xBF80F25C)));
#define IPC18 IPC18
extern volatile uint32_t   IPC18 __attribute__((section("sfrs"), address(0xBF80F260)));
typedef struct {
  uint32_t I2C3MIS:2;
  uint32_t I2C3MIP:3;
  uint32_t :3;
  uint32_t I2C3BCIS:2;
  uint32_t I2C3BCIP:3;
  uint32_t :3;
  uint32_t CCP1IS:2;
  uint32_t CCP1IP:3;
  uint32_t :3;
  uint32_t CCT1IS:2;
  uint32_t CCT1IP:3;
} __IPC18bits_t;
extern volatile __IPC18bits_t IPC18bits __asm__ ("IPC18") __attribute__((section("sfrs"), address(0xBF80F260)));
extern volatile uint32_t        IPC18CLR __attribute__((section("sfrs"),address(0xBF80F264)));
extern volatile uint32_t        IPC18SET __attribute__((section("sfrs"),address(0xBF80F268)));
extern volatile uint32_t        IPC18INV __attribute__((section("sfrs"),address(0xBF80F26C)));
#define IPC19 IPC19
extern volatile uint32_t   IPC19 __attribute__((section("sfrs"), address(0xBF80F270)));
typedef struct {
  uint32_t CCP2IS:2;
  uint32_t CCP2IP:3;
  uint32_t :3;
  uint32_t CCT2IS:2;
  uint32_t CCT2IP:3;
  uint32_t :3;
  uint32_t CCP3IS:2;
  uint32_t CCP3IP:3;
  uint32_t :3;
  uint32_t CCT3IS:2;
  uint32_t CCT3IP:3;
} __IPC19bits_t;
extern volatile __IPC19bits_t IPC19bits __asm__ ("IPC19") __attribute__((section("sfrs"), address(0xBF80F270)));
extern volatile uint32_t        IPC19CLR __attribute__((section("sfrs"),address(0xBF80F274)));
extern volatile uint32_t        IPC19SET __attribute__((section("sfrs"),address(0xBF80F278)));
extern volatile uint32_t        IPC19INV __attribute__((section("sfrs"),address(0xBF80F27C)));
#define IPC20 IPC20
extern volatile uint32_t   IPC20 __attribute__((section("sfrs"), address(0xBF80F280)));
typedef struct {
  uint32_t CCP4IS:2;
  uint32_t CCP4IP:3;
  uint32_t :3;
  uint32_t CCT4IS:2;
  uint32_t CCT4IP:3;
  uint32_t :3;
  uint32_t CCP5IS:2;
  uint32_t CCP5IP:3;
  uint32_t :3;
  uint32_t CCT5IS:2;
  uint32_t CCT5IP:3;
} __IPC20bits_t;
extern volatile __IPC20bits_t IPC20bits __asm__ ("IPC20") __attribute__((section("sfrs"), address(0xBF80F280)));
extern volatile uint32_t        IPC20CLR __attribute__((section("sfrs"),address(0xBF80F284)));
extern volatile uint32_t        IPC20SET __attribute__((section("sfrs"),address(0xBF80F288)));
extern volatile uint32_t        IPC20INV __attribute__((section("sfrs"),address(0xBF80F28C)));
#define IPC21 IPC21
extern volatile uint32_t   IPC21 __attribute__((section("sfrs"), address(0xBF80F290)));
typedef struct {
  uint32_t CCP6IS:2;
  uint32_t CCP6IP:3;
  uint32_t :3;
  uint32_t CCT6IS:2;
  uint32_t CCT6IP:3;
  uint32_t :3;
  uint32_t CCP7IS:2;
  uint32_t CCP7IP:3;
  uint32_t :3;
  uint32_t CCT7IS:2;
  uint32_t CCT7IP:3;
} __IPC21bits_t;
