Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM-GPM-0XX_DFP/1.3.50/include/proc/p32mm0064gpm064.h
extern volatile __AFICDbits_t AFICDbits __asm__ ("AFICD") __attribute__((section("sfrs"), address(0xBFC01748)));
#define AFPOR AFPOR
extern volatile uint32_t   AFPOR __attribute__((section("sfrs"), address(0xBFC0174C)));
typedef union {
  struct {
    uint32_t BOREN:2;
    uint32_t RETVR:1;
    uint32_t LPBOREN:1;
  };
  struct {
    uint32_t w:32;
  };
} __AFPORbits_t;
extern volatile __AFPORbits_t AFPORbits __asm__ ("AFPOR") __attribute__((section("sfrs"), address(0xBFC0174C)));
#define AFWDT AFWDT
extern volatile uint32_t   AFWDT __attribute__((section("sfrs"), address(0xBFC01750)));
typedef union {
  struct {
    uint32_t SWDTPS:5;
    uint32_t FWDTWINSZ:2;
    uint32_t WINDIS:1;
    uint32_t RWDTPS:5;
    uint32_t RCLKSEL:2;
    uint32_t FWDTEN:1;
  };
  struct {
    uint32_t w:32;
  };
} __AFWDTbits_t;
extern volatile __AFWDTbits_t AFWDTbits __asm__ ("AFWDT") __attribute__((section("sfrs"), address(0xBFC01750)));
#define AFOSCSEL AFOSCSEL
extern volatile uint32_t   AFOSCSEL __attribute__((section("sfrs"), address(0xBFC01754)));
typedef union {
  struct {
    uint32_t FNOSC:3;
    uint32_t :1;
    uint32_t PLLSRC:1;
    uint32_t :1;
    uint32_t SOSCEN:1;
    uint32_t IESO:1;
    uint32_t POSCMOD:2;
    uint32_t OSCIOFNC:1;
    uint32_t :1;
    uint32_t SOSCSEL:1;
    uint32_t :1;
    uint32_t FCKSM:2;
  };
  struct {
    uint32_t w:32;
  };
} __AFOSCSELbits_t;
extern volatile __AFOSCSELbits_t AFOSCSELbits __asm__ ("AFOSCSEL") __attribute__((section("sfrs"), address(0xBFC01754)));
#define AFSEC AFSEC
extern volatile uint32_t   AFSEC __attribute__((section("sfrs"), address(0xBFC01758)));
typedef union {
  struct {
    uint32_t :31;
    uint32_t CP:1;
  };
  struct {
    uint32_t w:32;
  };
} __AFSECbits_t;
extern volatile __AFSECbits_t AFSECbits __asm__ ("AFSEC") __attribute__((section("sfrs"), address(0xBFC01758)));
#ifdef __cplusplus
}
#endif

#elif defined (__LANGUAGE_ASSEMBLY__)
  .extern RTCCON1          /* 0xBF800000 */
  .extern RTCCON1CLR       /* 0xBF800004 */
  .extern RTCCON1SET       /* 0xBF800008 */
  .extern RTCCON1INV       /* 0xBF80000C */
  .extern RTCCON2          /* 0xBF800010 */
  .extern RTCCON2CLR       /* 0xBF800014 */
  .extern RTCCON2SET       /* 0xBF800018 */
  .extern RTCCON2INV       /* 0xBF80001C */
  .extern RTCSTAT          /* 0xBF800030 */
  .extern RTCSTATCLR       /* 0xBF800034 */
  .extern RTCSTATSET       /* 0xBF800038 */
  .extern RTCSTATINV       /* 0xBF80003C */
  .extern RTCTIME          /* 0xBF800040 */
  .extern RTCTIMECLR       /* 0xBF800044 */
  .extern RTCTIMESET       /* 0xBF800048 */
  .extern RTCTIMEINV       /* 0xBF80004C */
  .extern RTCDATE          /* 0xBF800050 */
  .extern RTCDATECLR       /* 0xBF800054 */
  .extern RTCDATESET       /* 0xBF800058 */
  .extern RTCDATEINV       /* 0xBF80005C */
  .extern ALMTIME          /* 0xBF800060 */
  .extern ALMTIMECLR       /* 0xBF800064 */
  .extern ALMTIMESET       /* 0xBF800068 */
  .extern ALMTIMEINV       /* 0xBF80006C */
  .extern ALMDATE          /* 0xBF800070 */
  .extern ALMDATECLR       /* 0xBF800074 */
  .extern ALMDATESET       /* 0xBF800078 */
  .extern ALMDATEINV       /* 0xBF80007C */
  .extern CCP1CON1         /* 0xBF800100 */
  .extern CCP1CON1CLR      /* 0xBF800104 */
  .extern CCP1CON1SET      /* 0xBF800108 */
  .extern CCP1CON1INV      /* 0xBF80010C */
  .extern CCP1CON2         /* 0xBF800110 */
  .extern CCP1CON2CLR      /* 0xBF800114 */
  .extern CCP1CON2SET      /* 0xBF800118 */
  .extern CCP1CON2INV      /* 0xBF80011C */
  .extern CCP1CON3         /* 0xBF800120 */
  .extern CCP1CON3CLR      /* 0xBF800124 */
  .extern CCP1CON3SET      /* 0xBF800128 */
  .extern CCP1CON3INV      /* 0xBF80012C */
  .extern CCP1STAT         /* 0xBF800130 */
  .extern CCP1STATCLR      /* 0xBF800134 */
  .extern CCP1STATSET      /* 0xBF800138 */
  .extern CCP1STATINV      /* 0xBF80013C */
  .extern CCP1TMR          /* 0xBF800140 */
  .extern CCP1TMRCLR       /* 0xBF800144 */
  .extern CCP1TMRSET       /* 0xBF800148 */
  .extern CCP1TMRINV       /* 0xBF80014C */
  .extern CCP1PR           /* 0xBF800150 */
  .extern CCP1PRCLR        /* 0xBF800154 */
  .extern CCP1PRSET        /* 0xBF800158 */
  .extern CCP1PRINV        /* 0xBF80015C */
  .extern CCP1RA           /* 0xBF800160 */
  .extern CCP1RACLR        /* 0xBF800164 */
  .extern CCP1RASET        /* 0xBF800168 */
  .extern CCP1RAINV        /* 0xBF80016C */
  .extern CCP1RB           /* 0xBF800170 */
  .extern CCP1RBCLR        /* 0xBF800174 */
  .extern CCP1RBSET        /* 0xBF800178 */
  .extern CCP1RBINV        /* 0xBF80017C */
  .extern CCP1BUF          /* 0xBF800180 */
  .extern CCP1BUFCLR       /* 0xBF800184 */
  .extern CCP1BUFSET       /* 0xBF800188 */
  .extern CCP1BUFINV       /* 0xBF80018C */
  .extern CCP2CON1         /* 0xBF800200 */
  .extern CCP2CON1CLR      /* 0xBF800204 */
  .extern CCP2CON1SET      /* 0xBF800208 */
  .extern CCP2CON1INV      /* 0xBF80020C */
  .extern CCP2CON2         /* 0xBF800210 */
  .extern CCP2CON2CLR      /* 0xBF800214 */
  .extern CCP2CON2SET      /* 0xBF800218 */
  .extern CCP2CON2INV      /* 0xBF80021C */
  .extern CCP2CON3         /* 0xBF800220 */
  .extern CCP2CON3CLR      /* 0xBF800224 */
  .extern CCP2CON3SET      /* 0xBF800228 */
  .extern CCP2CON3INV      /* 0xBF80022C */
  .extern CCP2STAT         /* 0xBF800230 */
  .extern CCP2STATCLR      /* 0xBF800234 */
  .extern CCP2STATSET      /* 0xBF800238 */
  .extern CCP2STATINV      /* 0xBF80023C */
  .extern CCP2TMR          /* 0xBF800240 */
  .extern CCP2TMRCLR       /* 0xBF800244 */
  .extern CCP2TMRSET       /* 0xBF800248 */
  .extern CCP2TMRINV       /* 0xBF80024C */
  .extern CCP2PR           /* 0xBF800250 */
  .extern CCP2PRCLR        /* 0xBF800254 */
  .extern CCP2PRSET        /* 0xBF800258 */
  .extern CCP2PRINV        /* 0xBF80025C */
  .extern CCP2RA           /* 0xBF800260 */
  .extern CCP2RACLR        /* 0xBF800264 */
  .extern CCP2RASET        /* 0xBF800268 */
  .extern CCP2RAINV        /* 0xBF80026C */
  .extern CCP2RB           /* 0xBF800270 */
  .extern CCP2RBCLR        /* 0xBF800274 */
  .extern CCP2RBSET        /* 0xBF800278 */
  .extern CCP2RBINV        /* 0xBF80027C */
  .extern CCP2BUF          /* 0xBF800280 */
  .extern CCP2BUFCLR       /* 0xBF800284 */
  .extern CCP2BUFSET       /* 0xBF800288 */
  .extern CCP2BUFINV       /* 0xBF80028C */
  .extern CCP3CON1         /* 0xBF800300 */
  .extern CCP3CON1CLR      /* 0xBF800304 */
  .extern CCP3CON1SET      /* 0xBF800308 */
  .extern CCP3CON1INV      /* 0xBF80030C */
  .extern CCP3CON2         /* 0xBF800310 */
  .extern CCP3CON2CLR      /* 0xBF800314 */
  .extern CCP3CON2SET      /* 0xBF800318 */
  .extern CCP3CON2INV      /* 0xBF80031C */
  .extern CCP3CON3         /* 0xBF800320 */
  .extern CCP3CON3CLR      /* 0xBF800324 */
  .extern CCP3CON3SET      /* 0xBF800328 */
  .extern CCP3CON3INV      /* 0xBF80032C */
  .extern CCP3STAT         /* 0xBF800330 */
  .extern CCP3STATCLR      /* 0xBF800334 */
  .extern CCP3STATSET      /* 0xBF800338 */
  .extern CCP3STATINV      /* 0xBF80033C */
  .extern CCP3TMR          /* 0xBF800340 */
  .extern CCP3TMRCLR       /* 0xBF800344 */
  .extern CCP3TMRSET       /* 0xBF800348 */
  .extern CCP3TMRINV       /* 0xBF80034C */
  .extern CCP3PR           /* 0xBF800350 */
  .extern CCP3PRCLR        /* 0xBF800354 */
  .extern CCP3PRSET        /* 0xBF800358 */
  .extern CCP3PRINV        /* 0xBF80035C */
  .extern CCP3RA           /* 0xBF800360 */
  .extern CCP3RACLR        /* 0xBF800364 */
  .extern CCP3RASET        /* 0xBF800368 */
  .extern CCP3RAINV        /* 0xBF80036C */
  .extern CCP3RB           /* 0xBF800370 */
  .extern CCP3RBCLR        /* 0xBF800374 */
  .extern CCP3RBSET        /* 0xBF800378 */
  .extern CCP3RBINV        /* 0xBF80037C */
  .extern CCP3BUF          /* 0xBF800380 */
  .extern CCP3BUFCLR       /* 0xBF800384 */
  .extern CCP3BUFSET       /* 0xBF800388 */
  .extern CCP3BUFINV       /* 0xBF80038C */
  .extern CCP4CON1         /* 0xBF800400 */
  .extern CCP4CON1CLR      /* 0xBF800404 */
  .extern CCP4CON1SET      /* 0xBF800408 */
  .extern CCP4CON1INV      /* 0xBF80040C */
  .extern CCP4CON2         /* 0xBF800410 */
  .extern CCP4CON2CLR      /* 0xBF800414 */
  .extern CCP4CON2SET      /* 0xBF800418 */
  .extern CCP4CON2INV      /* 0xBF80041C */
  .extern CCP4CON3         /* 0xBF800420 */
  .extern CCP4CON3CLR      /* 0xBF800424 */
  .extern CCP4CON3SET      /* 0xBF800428 */
  .extern CCP4CON3INV      /* 0xBF80042C */
  .extern CCP4STAT         /* 0xBF800430 */
  .extern CCP4STATCLR      /* 0xBF800434 */
  .extern CCP4STATSET      /* 0xBF800438 */
  .extern CCP4STATINV      /* 0xBF80043C */
  .extern CCP4TMR          /* 0xBF800440 */
  .extern CCP4TMRCLR       /* 0xBF800444 */
  .extern CCP4TMRSET       /* 0xBF800448 */
  .extern CCP4TMRINV       /* 0xBF80044C */
  .extern CCP4PR           /* 0xBF800450 */
  .extern CCP4PRCLR        /* 0xBF800454 */
  .extern CCP4PRSET        /* 0xBF800458 */
  .extern CCP4PRINV        /* 0xBF80045C */
  .extern CCP4RA           /* 0xBF800460 */
  .extern CCP4RACLR        /* 0xBF800464 */
  .extern CCP4RASET        /* 0xBF800468 */
  .extern CCP4RAINV        /* 0xBF80046C */
  .extern CCP4RB           /* 0xBF800470 */
  .extern CCP4RBCLR        /* 0xBF800474 */
  .extern CCP4RBSET        /* 0xBF800478 */
  .extern CCP4RBINV        /* 0xBF80047C */
  .extern CCP4BUF          /* 0xBF800480 */
  .extern CCP4BUFCLR       /* 0xBF800484 */
  .extern CCP4BUFSET       /* 0xBF800488 */
  .extern CCP4BUFINV       /* 0xBF80048C */
  .extern CCP5CON1         /* 0xBF800500 */
  .extern CCP5CON1CLR      /* 0xBF800504 */
  .extern CCP5CON1SET      /* 0xBF800508 */
  .extern CCP5CON1INV      /* 0xBF80050C */
  .extern CCP5CON2         /* 0xBF800510 */
  .extern CCP5CON2CLR      /* 0xBF800514 */
  .extern CCP5CON2SET      /* 0xBF800518 */
  .extern CCP5CON2INV      /* 0xBF80051C */
  .extern CCP5CON3         /* 0xBF800520 */
  .extern CCP5CON3CLR      /* 0xBF800524 */
  .extern CCP5CON3SET      /* 0xBF800528 */
  .extern CCP5CON3INV      /* 0xBF80052C */
  .extern CCP5STAT         /* 0xBF800530 */
  .extern CCP5STATCLR      /* 0xBF800534 */
  .extern CCP5STATSET      /* 0xBF800538 */
  .extern CCP5STATINV      /* 0xBF80053C */
  .extern CCP5TMR          /* 0xBF800540 */
  .extern CCP5TMRCLR       /* 0xBF800544 */
  .extern CCP5TMRSET       /* 0xBF800548 */
  .extern CCP5TMRINV       /* 0xBF80054C */
  .extern CCP5PR           /* 0xBF800550 */
  .extern CCP5PRCLR        /* 0xBF800554 */
  .extern CCP5PRSET        /* 0xBF800558 */
  .extern CCP5PRINV        /* 0xBF80055C */
  .extern CCP5RA           /* 0xBF800560 */
  .extern CCP5RACLR        /* 0xBF800564 */
  .extern CCP5RASET        /* 0xBF800568 */
  .extern CCP5RAINV        /* 0xBF80056C */
  .extern CCP5RB           /* 0xBF800570 */
  .extern CCP5RBCLR        /* 0xBF800574 */
  .extern CCP5RBSET        /* 0xBF800578 */
  .extern CCP5RBINV        /* 0xBF80057C */
  .extern CCP5BUF          /* 0xBF800580 */
  .extern CCP5BUFCLR       /* 0xBF800584 */
  .extern CCP5BUFSET       /* 0xBF800588 */
  .extern CCP5BUFINV       /* 0xBF80058C */
  .extern CCP6CON1         /* 0xBF800600 */
  .extern CCP6CON1CLR      /* 0xBF800604 */
  .extern CCP6CON1SET      /* 0xBF800608 */
  .extern CCP6CON1INV      /* 0xBF80060C */
  .extern CCP6CON2         /* 0xBF800610 */
  .extern CCP6CON2CLR      /* 0xBF800614 */
  .extern CCP6CON2SET      /* 0xBF800618 */
  .extern CCP6CON2INV      /* 0xBF80061C */
  .extern CCP6CON3         /* 0xBF800620 */
  .extern CCP6CON3CLR      /* 0xBF800624 */
  .extern CCP6CON3SET      /* 0xBF800628 */
  .extern CCP6CON3INV      /* 0xBF80062C */
  .extern CCP6STAT         /* 0xBF800630 */
  .extern CCP6STATCLR      /* 0xBF800634 */
  .extern CCP6STATSET      /* 0xBF800638 */
  .extern CCP6STATINV      /* 0xBF80063C */
  .extern CCP6TMR          /* 0xBF800640 */
  .extern CCP6TMRCLR       /* 0xBF800644 */
  .extern CCP6TMRSET       /* 0xBF800648 */
  .extern CCP6TMRINV       /* 0xBF80064C */
  .extern CCP6PR           /* 0xBF800650 */
  .extern CCP6PRCLR        /* 0xBF800654 */
  .extern CCP6PRSET        /* 0xBF800658 */
  .extern CCP6PRINV        /* 0xBF80065C */
  .extern CCP6RA           /* 0xBF800660 */
  .extern CCP6RACLR        /* 0xBF800664 */
  .extern CCP6RASET        /* 0xBF800668 */
  .extern CCP6RAINV        /* 0xBF80066C */
  .extern CCP6RB           /* 0xBF800670 */
  .extern CCP6RBCLR        /* 0xBF800674 */
  .extern CCP6RBSET        /* 0xBF800678 */
  .extern CCP6RBINV        /* 0xBF80067C */
  .extern CCP6BUF          /* 0xBF800680 */
  .extern CCP6BUFCLR       /* 0xBF800684 */
  .extern CCP6BUFSET       /* 0xBF800688 */
  .extern CCP6BUFINV       /* 0xBF80068C */
  .extern CCP7CON1         /* 0xBF800700 */
  .extern CCP7CON1CLR      /* 0xBF800704 */
  .extern CCP7CON1SET      /* 0xBF800708 */
  .extern CCP7CON1INV      /* 0xBF80070C */
  .extern CCP7CON2         /* 0xBF800710 */
  .extern CCP7CON2CLR      /* 0xBF800714 */
  .extern CCP7CON2SET      /* 0xBF800718 */
  .extern CCP7CON2INV      /* 0xBF80071C */
  .extern CCP7CON3         /* 0xBF800720 */
  .extern CCP7CON3CLR      /* 0xBF800724 */
  .extern CCP7CON3SET      /* 0xBF800728 */
  .extern CCP7CON3INV      /* 0xBF80072C */
  .extern CCP7STAT         /* 0xBF800730 */
  .extern CCP7STATCLR      /* 0xBF800734 */
  .extern CCP7STATSET      /* 0xBF800738 */
  .extern CCP7STATINV      /* 0xBF80073C */
  .extern CCP7TMR          /* 0xBF800740 */
  .extern CCP7TMRCLR       /* 0xBF800744 */
  .extern CCP7TMRSET       /* 0xBF800748 */
  .extern CCP7TMRINV       /* 0xBF80074C */
  .extern CCP7PR           /* 0xBF800750 */
  .extern CCP7PRCLR        /* 0xBF800754 */
  .extern CCP7PRSET        /* 0xBF800758 */
  .extern CCP7PRINV        /* 0xBF80075C */
  .extern CCP7RA           /* 0xBF800760 */
  .extern CCP7RACLR        /* 0xBF800764 */
  .extern CCP7RASET        /* 0xBF800768 */
  .extern CCP7RAINV        /* 0xBF80076C */
  .extern CCP7RB           /* 0xBF800770 */
  .extern CCP7RBCLR        /* 0xBF800774 */
  .extern CCP7RBSET        /* 0xBF800778 */
  .extern CCP7RBINV        /* 0xBF80077C */
  .extern CCP7BUF          /* 0xBF800780 */
  .extern CCP7BUFCLR       /* 0xBF800784 */
  .extern CCP7BUFSET       /* 0xBF800788 */
  .extern CCP7BUFINV       /* 0xBF80078C */
  .extern CCP8CON1         /* 0xBF800800 */
  .extern CCP8CON1CLR      /* 0xBF800804 */
  .extern CCP8CON1SET      /* 0xBF800808 */
  .extern CCP8CON1INV      /* 0xBF80080C */
  .extern CCP8CON2         /* 0xBF800810 */
  .extern CCP8CON2CLR      /* 0xBF800814 */
  .extern CCP8CON2SET      /* 0xBF800818 */
  .extern CCP8CON2INV      /* 0xBF80081C */
  .extern CCP8CON3         /* 0xBF800820 */
  .extern CCP8CON3CLR      /* 0xBF800824 */
  .extern CCP8CON3SET      /* 0xBF800828 */
  .extern CCP8CON3INV      /* 0xBF80082C */
  .extern CCP8STAT         /* 0xBF800830 */
  .extern CCP8STATCLR      /* 0xBF800834 */
  .extern CCP8STATSET      /* 0xBF800838 */
  .extern CCP8STATINV      /* 0xBF80083C */
  .extern CCP8TMR          /* 0xBF800840 */
  .extern CCP8TMRCLR       /* 0xBF800844 */
  .extern CCP8TMRSET       /* 0xBF800848 */
  .extern CCP8TMRINV       /* 0xBF80084C */
  .extern CCP8PR           /* 0xBF800850 */
  .extern CCP8PRCLR        /* 0xBF800854 */
  .extern CCP8PRSET        /* 0xBF800858 */
  .extern CCP8PRINV        /* 0xBF80085C */
  .extern CCP8RA           /* 0xBF800860 */
  .extern CCP8RACLR        /* 0xBF800864 */
  .extern CCP8RASET        /* 0xBF800868 */
  .extern CCP8RAINV        /* 0xBF80086C */
  .extern CCP8RB           /* 0xBF800870 */
  .extern CCP8RBCLR        /* 0xBF800874 */
  .extern CCP8RBSET        /* 0xBF800878 */
  .extern CCP8RBINV        /* 0xBF80087C */
  .extern CCP8BUF          /* 0xBF800880 */
  .extern CCP8BUFCLR       /* 0xBF800884 */
  .extern CCP8BUFSET       /* 0xBF800888 */
  .extern CCP8BUFINV       /* 0xBF80088C */
  .extern CCP9CON1         /* 0xBF800900 */
  .extern CCP9CON1CLR      /* 0xBF800904 */
  .extern CCP9CON1SET      /* 0xBF800908 */
  .extern CCP9CON1INV      /* 0xBF80090C */
  .extern CCP9CON2         /* 0xBF800910 */
  .extern CCP9CON2CLR      /* 0xBF800914 */
  .extern CCP9CON2SET      /* 0xBF800918 */
  .extern CCP9CON2INV      /* 0xBF80091C */
  .extern CCP9CON3         /* 0xBF800920 */
  .extern CCP9CON3CLR      /* 0xBF800924 */
  .extern CCP9CON3SET      /* 0xBF800928 */
  .extern CCP9CON3INV      /* 0xBF80092C */
  .extern CCP9STAT         /* 0xBF800930 */
  .extern CCP9STATCLR      /* 0xBF800934 */
  .extern CCP9STATSET      /* 0xBF800938 */
  .extern CCP9STATINV      /* 0xBF80093C */
  .extern CCP9TMR          /* 0xBF800940 */
  .extern CCP9TMRCLR       /* 0xBF800944 */
  .extern CCP9TMRSET       /* 0xBF800948 */
  .extern CCP9TMRINV       /* 0xBF80094C */
  .extern CCP9PR           /* 0xBF800950 */
  .extern CCP9PRCLR        /* 0xBF800954 */
  .extern CCP9PRSET        /* 0xBF800958 */
  .extern CCP9PRINV        /* 0xBF80095C */
  .extern CCP9RA           /* 0xBF800960 */
  .extern CCP9RACLR        /* 0xBF800964 */
  .extern CCP9RASET        /* 0xBF800968 */
  .extern CCP9RAINV        /* 0xBF80096C */
  .extern CCP9RB           /* 0xBF800970 */
  .extern CCP9RBCLR        /* 0xBF800974 */
  .extern CCP9RBSET        /* 0xBF800978 */
  .extern CCP9RBINV        /* 0xBF80097C */
  .extern CCP9BUF          /* 0xBF800980 */
  .extern CCP9BUFCLR       /* 0xBF800984 */
  .extern CCP9BUFSET       /* 0xBF800988 */
  .extern CCP9BUFINV       /* 0xBF80098C */
  .extern I2C1CON          /* 0xBF801500 */
  .extern I2C1CONCLR       /* 0xBF801504 */
  .extern I2C1CONSET       /* 0xBF801508 */
  .extern I2C1CONINV       /* 0xBF80150C */
  .extern I2C1STAT         /* 0xBF801510 */
  .extern I2C1STATCLR      /* 0xBF801514 */
  .extern I2C1STATSET      /* 0xBF801518 */
  .extern I2C1STATINV      /* 0xBF80151C */
  .extern I2C1ADD          /* 0xBF801520 */
  .extern I2C1ADDCLR       /* 0xBF801524 */
  .extern I2C1ADDSET       /* 0xBF801528 */
  .extern I2C1ADDINV       /* 0xBF80152C */
  .extern I2C1MSK          /* 0xBF801530 */
  .extern I2C1MSKCLR       /* 0xBF801534 */
  .extern I2C1MSKSET       /* 0xBF801538 */
  .extern I2C1MSKINV       /* 0xBF80153C */
  .extern I2C1BRG          /* 0xBF801540 */
  .extern I2C1BRGCLR       /* 0xBF801544 */
  .extern I2C1BRGSET       /* 0xBF801548 */
  .extern I2C1BRGINV       /* 0xBF80154C */
  .extern I2C1TRN          /* 0xBF801550 */
  .extern I2C1TRNCLR       /* 0xBF801554 */
  .extern I2C1TRNSET       /* 0xBF801558 */
  .extern I2C1TRNINV       /* 0xBF80155C */
  .extern I2C1RCV          /* 0xBF801560 */
  .extern I2C1RCVCLR       /* 0xBF801564 */
  .extern I2C1RCVSET       /* 0xBF801568 */
  .extern I2C1RCVINV       /* 0xBF80156C */
  .extern I2C2CON          /* 0xBF801600 */
  .extern I2C2CONCLR       /* 0xBF801604 */
  .extern I2C2CONSET       /* 0xBF801608 */
  .extern I2C2CONINV       /* 0xBF80160C */
  .extern I2C2STAT         /* 0xBF801610 */
  .extern I2C2STATCLR      /* 0xBF801614 */
  .extern I2C2STATSET      /* 0xBF801618 */
  .extern I2C2STATINV      /* 0xBF80161C */
  .extern I2C2ADD          /* 0xBF801620 */
  .extern I2C2ADDCLR       /* 0xBF801624 */
  .extern I2C2ADDSET       /* 0xBF801628 */
  .extern I2C2ADDINV       /* 0xBF80162C */
  .extern I2C2MSK          /* 0xBF801630 */
  .extern I2C2MSKCLR       /* 0xBF801634 */
  .extern I2C2MSKSET       /* 0xBF801638 */
  .extern I2C2MSKINV       /* 0xBF80163C */
  .extern I2C2BRG          /* 0xBF801640 */
  .extern I2C2BRGCLR       /* 0xBF801644 */
  .extern I2C2BRGSET       /* 0xBF801648 */
  .extern I2C2BRGINV       /* 0xBF80164C */
  .extern I2C2TRN          /* 0xBF801650 */
  .extern I2C2TRNCLR       /* 0xBF801654 */
  .extern I2C2TRNSET       /* 0xBF801658 */
  .extern I2C2TRNINV       /* 0xBF80165C */
  .extern I2C2RCV          /* 0xBF801660 */
  .extern I2C2RCVCLR       /* 0xBF801664 */
  .extern I2C2RCVSET       /* 0xBF801668 */
  .extern I2C2RCVINV       /* 0xBF80166C */
  .extern I2C3CON          /* 0xBF801700 */
  .extern I2C3CONCLR       /* 0xBF801704 */
  .extern I2C3CONSET       /* 0xBF801708 */
  .extern I2C3CONINV       /* 0xBF80170C */
  .extern I2C3STAT         /* 0xBF801710 */
  .extern I2C3STATCLR      /* 0xBF801714 */
  .extern I2C3STATSET      /* 0xBF801718 */
  .extern I2C3STATINV      /* 0xBF80171C */
  .extern I2C3ADD          /* 0xBF801720 */
  .extern I2C3ADDCLR       /* 0xBF801724 */
  .extern I2C3ADDSET       /* 0xBF801728 */
  .extern I2C3ADDINV       /* 0xBF80172C */
  .extern I2C3MSK          /* 0xBF801730 */
  .extern I2C3MSKCLR       /* 0xBF801734 */
  .extern I2C3MSKSET       /* 0xBF801738 */
  .extern I2C3MSKINV       /* 0xBF80173C */
  .extern I2C3BRG          /* 0xBF801740 */
  .extern I2C3BRGCLR       /* 0xBF801744 */
  .extern I2C3BRGSET       /* 0xBF801748 */
  .extern I2C3BRGINV       /* 0xBF80174C */
  .extern I2C3TRN          /* 0xBF801750 */
  .extern I2C3TRNCLR       /* 0xBF801754 */
  .extern I2C3TRNSET       /* 0xBF801758 */
  .extern I2C3TRNINV       /* 0xBF80175C */
  .extern I2C3RCV          /* 0xBF801760 */
  .extern I2C3RCVCLR       /* 0xBF801764 */
  .extern I2C3RCVSET       /* 0xBF801768 */
  .extern I2C3RCVINV       /* 0xBF80176C */
  .extern U1MODE           /* 0xBF801800 */
  .extern U1MODECLR        /* 0xBF801804 */
  .extern U1MODESET        /* 0xBF801808 */
  .extern U1MODEINV        /* 0xBF80180C */
  .extern U1STA            /* 0xBF801810 */
  .extern U1STACLR         /* 0xBF801814 */
  .extern U1STASET         /* 0xBF801818 */
  .extern U1STAINV         /* 0xBF80181C */
  .extern U1TXREG          /* 0xBF801820 */
  .extern U1RXREG          /* 0xBF801830 */
  .extern U1BRG            /* 0xBF801840 */
  .extern U1BRGCLR         /* 0xBF801844 */
  .extern U1BRGSET         /* 0xBF801848 */
  .extern U1BRGINV         /* 0xBF80184C */
  .extern U2MODE           /* 0xBF801900 */
  .extern U2MODECLR        /* 0xBF801904 */
  .extern U2MODESET        /* 0xBF801908 */
  .extern U2MODEINV        /* 0xBF80190C */
  .extern U2STA            /* 0xBF801910 */
  .extern U2STACLR         /* 0xBF801914 */
  .extern U2STASET         /* 0xBF801918 */
  .extern U2STAINV         /* 0xBF80191C */
  .extern U2TXREG          /* 0xBF801920 */
  .extern U2RXREG          /* 0xBF801930 */
  .extern U2BRG            /* 0xBF801940 */
  .extern U2BRGCLR         /* 0xBF801944 */
  .extern U2BRGSET         /* 0xBF801948 */
  .extern U2BRGINV         /* 0xBF80194C */
  .extern U3MODE           /* 0xBF802000 */
  .extern U3MODECLR        /* 0xBF802004 */
  .extern U3MODESET        /* 0xBF802008 */
  .extern U3MODEINV        /* 0xBF80200C */
  .extern U3STA            /* 0xBF802010 */
  .extern U3STACLR         /* 0xBF802014 */
  .extern U3STASET         /* 0xBF802018 */
  .extern U3STAINV         /* 0xBF80201C */
  .extern U3TXREG          /* 0xBF802020 */
  .extern U3RXREG          /* 0xBF802030 */
  .extern U3BRG            /* 0xBF802040 */
  .extern U3BRGCLR         /* 0xBF802044 */
  .extern U3BRGSET         /* 0xBF802048 */
  .extern U3BRGINV         /* 0xBF80204C */
  .extern ADC1BUF0         /* 0xBF802100 */
  .extern ADC1BUF0CLR      /* 0xBF802104 */
  .extern ADC1BUF0SET      /* 0xBF802108 */
  .extern ADC1BUF0INV      /* 0xBF80210C */
  .extern ADC1BUF1         /* 0xBF802110 */
  .extern ADC1BUF1CLR      /* 0xBF802114 */
  .extern ADC1BUF1SET      /* 0xBF802118 */
  .extern ADC1BUF1INV      /* 0xBF80211C */
  .extern ADC1BUF2         /* 0xBF802120 */
  .extern ADC1BUF2CLR      /* 0xBF802124 */
  .extern ADC1BUF2SET      /* 0xBF802128 */
  .extern ADC1BUF2INV      /* 0xBF80212C */
  .extern ADC1BUF3         /* 0xBF802130 */
  .extern ADC1BUF3CLR      /* 0xBF802134 */
  .extern ADC1BUF3SET      /* 0xBF802138 */
  .extern ADC1BUF3INV      /* 0xBF80213C */
  .extern ADC1BUF4         /* 0xBF802140 */
  .extern ADC1BUF4CLR      /* 0xBF802144 */
  .extern ADC1BUF4SET      /* 0xBF802148 */
  .extern ADC1BUF4INV      /* 0xBF80214C */
  .extern ADC1BUF5         /* 0xBF802150 */
  .extern ADC1BUF5CLR      /* 0xBF802154 */
  .extern ADC1BUF5SET      /* 0xBF802158 */
