Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM-GPM-0XX_DFP/1.3.50/include/proc/p32mm0064gpm064.h
  .extern PMD1             /* 0xBF8035C0 */
  .extern PMD1CLR          /* 0xBF8035C4 */
  .extern PMD1SET          /* 0xBF8035C8 */
  .extern PMD1INV          /* 0xBF8035CC */
  .extern PMD2             /* 0xBF8035D0 */
  .extern PMD2CLR          /* 0xBF8035D4 */
  .extern PMD2SET          /* 0xBF8035D8 */
  .extern PMD2INV          /* 0xBF8035DC */
  .extern PMD3             /* 0xBF8035E0 */
  .extern PMD3CLR          /* 0xBF8035E4 */
  .extern PMD3SET          /* 0xBF8035E8 */
  .extern PMD3INV          /* 0xBF8035EC */
  .extern PMD4             /* 0xBF8035F0 */
  .extern PMD4CLR          /* 0xBF8035F4 */
  .extern PMD4SET          /* 0xBF8035F8 */
  .extern PMD4INV          /* 0xBF8035FC */
  .extern PMD5             /* 0xBF803600 */
  .extern PMD5CLR          /* 0xBF803604 */
  .extern PMD5SET          /* 0xBF803608 */
  .extern PMD5INV          /* 0xBF80360C */
  .extern PMD6             /* 0xBF803610 */
  .extern PMD6CLR          /* 0xBF803614 */
  .extern PMD6SET          /* 0xBF803618 */
  .extern PMD6INV          /* 0xBF80361C */
  .extern PMD7             /* 0xBF803620 */
  .extern PMD7CLR          /* 0xBF803624 */
  .extern PMD7SET          /* 0xBF803628 */
  .extern PMD7INV          /* 0xBF80362C */
  .extern CFGCON           /* 0xBF803640 */
  .extern CFGCONCLR        /* 0xBF803644 */
  .extern CFGCONSET        /* 0xBF803648 */
  .extern CFGCONINV        /* 0xBF80364C */
  .extern DEVID            /* 0xBF803660 */
  .extern DEVIDCLR         /* 0xBF803664 */
  .extern DEVIDSET         /* 0xBF803668 */
  .extern DEVIDINV         /* 0xBF80366C */
  .extern SYSKEY           /* 0xBF803670 */
  .extern SYSKEYCLR        /* 0xBF803674 */
  .extern SYSKEYSET        /* 0xBF803678 */
  .extern SYSKEYINV        /* 0xBF80367C */
  .extern WDTCON           /* 0xBF803990 */
  .extern WDTCONCLR        /* 0xBF803994 */
  .extern WDTCONSET        /* 0xBF803998 */
  .extern WDTCONINV        /* 0xBF80399C */
  .extern T1CON            /* 0xBF808000 */
  .extern T1CONCLR         /* 0xBF808004 */
  .extern T1CONSET         /* 0xBF808008 */
  .extern T1CONINV         /* 0xBF80800C */
  .extern TMR1             /* 0xBF808010 */
  .extern TMR1CLR          /* 0xBF808014 */
  .extern TMR1SET          /* 0xBF808018 */
  .extern TMR1INV          /* 0xBF80801C */
  .extern PR1              /* 0xBF808020 */
  .extern PR1CLR           /* 0xBF808024 */
  .extern PR1SET           /* 0xBF808028 */
  .extern PR1INV           /* 0xBF80802C */
  .extern T2CON            /* 0xBF808040 */
  .extern T2CONCLR         /* 0xBF808044 */
  .extern T2CONSET         /* 0xBF808048 */
  .extern T2CONINV         /* 0xBF80804C */
  .extern TMR2             /* 0xBF808050 */
  .extern TMR2CLR          /* 0xBF808054 */
  .extern TMR2SET          /* 0xBF808058 */
  .extern TMR2INV          /* 0xBF80805C */
  .extern PR2              /* 0xBF808060 */
  .extern PR2CLR           /* 0xBF808064 */
  .extern PR2SET           /* 0xBF808068 */
  .extern PR2INV           /* 0xBF80806C */
  .extern T3CON            /* 0xBF808080 */
  .extern T3CONCLR         /* 0xBF808084 */
  .extern T3CONSET         /* 0xBF808088 */
  .extern T3CONINV         /* 0xBF80808C */
  .extern TMR3             /* 0xBF808090 */
  .extern TMR3CLR          /* 0xBF808094 */
  .extern TMR3SET          /* 0xBF808098 */
  .extern TMR3INV          /* 0xBF80809C */
  .extern PR3              /* 0xBF8080A0 */
  .extern PR3CLR           /* 0xBF8080A4 */
  .extern PR3SET           /* 0xBF8080A8 */
  .extern PR3INV           /* 0xBF8080AC */
  .extern SPI1CON          /* 0xBF808100 */
  .extern SPI1CONCLR       /* 0xBF808104 */
  .extern SPI1CONSET       /* 0xBF808108 */
  .extern SPI1CONINV       /* 0xBF80810C */
  .extern SPI1STAT         /* 0xBF808110 */
  .extern SPI1STATCLR      /* 0xBF808114 */
  .extern SPI1STATSET      /* 0xBF808118 */
  .extern SPI1STATINV      /* 0xBF80811C */
  .extern SPI1BUF          /* 0xBF808120 */
  .extern SPI1BRG          /* 0xBF808130 */
  .extern SPI1BRGCLR       /* 0xBF808134 */
  .extern SPI1BRGSET       /* 0xBF808138 */
  .extern SPI1BRGINV       /* 0xBF80813C */
  .extern SPI1CON2         /* 0xBF808140 */
  .extern SPI1CON2CLR      /* 0xBF808144 */
  .extern SPI1CON2SET      /* 0xBF808148 */
  .extern SPI1CON2INV      /* 0xBF80814C */
  .extern SPI2CON          /* 0xBF808200 */
  .extern SPI2CONCLR       /* 0xBF808204 */
  .extern SPI2CONSET       /* 0xBF808208 */
  .extern SPI2CONINV       /* 0xBF80820C */
  .extern SPI2STAT         /* 0xBF808210 */
  .extern SPI2STATCLR      /* 0xBF808214 */
  .extern SPI2STATSET      /* 0xBF808218 */
  .extern SPI2STATINV      /* 0xBF80821C */
  .extern SPI2BUF          /* 0xBF808220 */
  .extern SPI2BRG          /* 0xBF808230 */
  .extern SPI2BRGCLR       /* 0xBF808234 */
  .extern SPI2BRGSET       /* 0xBF808238 */
  .extern SPI2BRGINV       /* 0xBF80823C */
  .extern SPI2CON2         /* 0xBF808240 */
  .extern SPI2CON2CLR      /* 0xBF808244 */
  .extern SPI2CON2SET      /* 0xBF808248 */
  .extern SPI2CON2INV      /* 0xBF80824C */
  .extern SPI3CON          /* 0xBF808300 */
  .extern SPI3CONCLR       /* 0xBF808304 */
  .extern SPI3CONSET       /* 0xBF808308 */
  .extern SPI3CONINV       /* 0xBF80830C */
  .extern SPI3STAT         /* 0xBF808310 */
  .extern SPI3STATCLR      /* 0xBF808314 */
  .extern SPI3STATSET      /* 0xBF808318 */
  .extern SPI3STATINV      /* 0xBF80831C */
  .extern SPI3BUF          /* 0xBF808320 */
  .extern SPI3BRG          /* 0xBF808330 */
  .extern SPI3BRGCLR       /* 0xBF808334 */
  .extern SPI3BRGSET       /* 0xBF808338 */
  .extern SPI3BRGINV       /* 0xBF80833C */
  .extern SPI3CON2         /* 0xBF808340 */
  .extern SPI3CON2CLR      /* 0xBF808344 */
  .extern SPI3CON2SET      /* 0xBF808348 */
  .extern SPI3CON2INV      /* 0xBF80834C */
  .extern U1OTGIR          /* 0xBF808440 */
  .extern U1OTGIRCLR       /* 0xBF808444 */
  .extern U1OTGIE          /* 0xBF808450 */
  .extern U1OTGIECLR       /* 0xBF808454 */
  .extern U1OTGIESET       /* 0xBF808458 */
  .extern U1OTGIEINV       /* 0xBF80845C */
  .extern U1OTGSTAT        /* 0xBF808460 */
  .extern U1OTGCON         /* 0xBF808470 */
  .extern U1OTGCONCLR      /* 0xBF808474 */
  .extern U1OTGCONSET      /* 0xBF808478 */
  .extern U1OTGCONINV      /* 0xBF80847C */
  .extern U1PWRC           /* 0xBF808480 */
  .extern U1PWRCCLR        /* 0xBF808484 */
  .extern U1PWRCSET        /* 0xBF808488 */
  .extern U1PWRCINV        /* 0xBF80848C */
  .extern U1IR             /* 0xBF808600 */
  .extern U1IRCLR          /* 0xBF808604 */
  .extern U1IE             /* 0xBF808610 */
  .extern U1IECLR          /* 0xBF808614 */
  .extern U1IESET          /* 0xBF808618 */
  .extern U1IEINV          /* 0xBF80861C */
  .extern U1EIR            /* 0xBF808620 */
  .extern U1EIRCLR         /* 0xBF808624 */
  .extern U1EIE            /* 0xBF808630 */
  .extern U1EIECLR         /* 0xBF808634 */
  .extern U1EIESET         /* 0xBF808638 */
  .extern U1EIEINV         /* 0xBF80863C */
  .extern U1STAT           /* 0xBF808640 */
  .extern U1CON            /* 0xBF808650 */
  .extern U1CONCLR         /* 0xBF808654 */
  .extern U1CONSET         /* 0xBF808658 */
  .extern U1CONINV         /* 0xBF80865C */
  .extern U1ADDR           /* 0xBF808660 */
  .extern U1ADDRCLR        /* 0xBF808664 */
  .extern U1ADDRSET        /* 0xBF808668 */
  .extern U1ADDRINV        /* 0xBF80866C */
  .extern U1BDTP1          /* 0xBF808670 */
  .extern U1BDTP1CLR       /* 0xBF808674 */
  .extern U1BDTP1SET       /* 0xBF808678 */
  .extern U1BDTP1INV       /* 0xBF80867C */
  .extern U1FRML           /* 0xBF808680 */
  .extern U1FRMH           /* 0xBF808690 */
  .extern U1TOK            /* 0xBF8086A0 */
  .extern U1TOKCLR         /* 0xBF8086A4 */
  .extern U1TOKSET         /* 0xBF8086A8 */
  .extern U1TOKINV         /* 0xBF8086AC */
  .extern U1SOF            /* 0xBF8086B0 */
  .extern U1SOFCLR         /* 0xBF8086B4 */
  .extern U1SOFSET         /* 0xBF8086B8 */
  .extern U1SOFINV         /* 0xBF8086BC */
  .extern U1BDTP2          /* 0xBF8086C0 */
  .extern U1BDTP2CLR       /* 0xBF8086C4 */
  .extern U1BDTP2SET       /* 0xBF8086C8 */
  .extern U1BDTP2INV       /* 0xBF8086CC */
  .extern U1BDTP3          /* 0xBF8086D0 */
  .extern U1BDTP3CLR       /* 0xBF8086D4 */
  .extern U1BDTP3SET       /* 0xBF8086D8 */
  .extern U1BDTP3INV       /* 0xBF8086DC */
  .extern U1CNFG1          /* 0xBF8086E0 */
  .extern U1CNFG1CLR       /* 0xBF8086E4 */
  .extern U1CNFG1SET       /* 0xBF8086E8 */
  .extern U1CNFG1INV       /* 0xBF8086EC */
  .extern U1EP0            /* 0xBF808700 */
  .extern U1EP0CLR         /* 0xBF808704 */
  .extern U1EP0SET         /* 0xBF808708 */
  .extern U1EP0INV         /* 0xBF80870C */
  .extern U1EP1            /* 0xBF808710 */
  .extern U1EP1CLR         /* 0xBF808714 */
  .extern U1EP1SET         /* 0xBF808718 */
  .extern U1EP1INV         /* 0xBF80871C */
  .extern U1EP2            /* 0xBF808720 */
  .extern U1EP2CLR         /* 0xBF808724 */
  .extern U1EP2SET         /* 0xBF808728 */
  .extern U1EP2INV         /* 0xBF80872C */
  .extern U1EP3            /* 0xBF808730 */
  .extern U1EP3CLR         /* 0xBF808734 */
  .extern U1EP3SET         /* 0xBF808738 */
  .extern U1EP3INV         /* 0xBF80873C */
  .extern U1EP4            /* 0xBF808740 */
  .extern U1EP4CLR         /* 0xBF808744 */
  .extern U1EP4SET         /* 0xBF808748 */
  .extern U1EP4INV         /* 0xBF80874C */
  .extern U1EP5            /* 0xBF808750 */
  .extern U1EP5CLR         /* 0xBF808754 */
  .extern U1EP5SET         /* 0xBF808758 */
  .extern U1EP5INV         /* 0xBF80875C */
  .extern U1EP6            /* 0xBF808760 */
  .extern U1EP6CLR         /* 0xBF808764 */
  .extern U1EP6SET         /* 0xBF808768 */
  .extern U1EP6INV         /* 0xBF80876C */
  .extern U1EP7            /* 0xBF808770 */
  .extern U1EP7CLR         /* 0xBF808774 */
  .extern U1EP7SET         /* 0xBF808778 */
  .extern U1EP7INV         /* 0xBF80877C */
  .extern U1EP8            /* 0xBF808780 */
  .extern U1EP8CLR         /* 0xBF808784 */
  .extern U1EP8SET         /* 0xBF808788 */
  .extern U1EP8INV         /* 0xBF80878C */
  .extern U1EP9            /* 0xBF808790 */
  .extern U1EP9CLR         /* 0xBF808794 */
  .extern U1EP9SET         /* 0xBF808798 */
  .extern U1EP9INV         /* 0xBF80879C */
  .extern U1EP10           /* 0xBF8087A0 */
  .extern U1EP10CLR        /* 0xBF8087A4 */
  .extern U1EP10SET        /* 0xBF8087A8 */
  .extern U1EP10INV        /* 0xBF8087AC */
  .extern U1EP11           /* 0xBF8087B0 */
  .extern U1EP11CLR        /* 0xBF8087B4 */
  .extern U1EP11SET        /* 0xBF8087B8 */
  .extern U1EP11INV        /* 0xBF8087BC */
  .extern U1EP12           /* 0xBF8087C0 */
  .extern U1EP12CLR        /* 0xBF8087C4 */
  .extern U1EP12SET        /* 0xBF8087C8 */
  .extern U1EP12INV        /* 0xBF8087CC */
  .extern U1EP13           /* 0xBF8087D0 */
  .extern U1EP13CLR        /* 0xBF8087D4 */
  .extern U1EP13SET        /* 0xBF8087D8 */
  .extern U1EP13INV        /* 0xBF8087DC */
  .extern U1EP14           /* 0xBF8087E0 */
  .extern U1EP14CLR        /* 0xBF8087E4 */
  .extern U1EP14SET        /* 0xBF8087E8 */
  .extern U1EP14INV        /* 0xBF8087EC */
  .extern U1EP15           /* 0xBF8087F0 */
  .extern U1EP15CLR        /* 0xBF8087F4 */
  .extern U1EP15SET        /* 0xBF8087F8 */
  .extern U1EP15INV        /* 0xBF8087FC */
  .extern DMACON           /* 0xBF808900 */
  .extern DMACONCLR        /* 0xBF808904 */
  .extern DMACONSET        /* 0xBF808908 */
  .extern DMACONINV        /* 0xBF80890C */
  .extern DMASTAT          /* 0xBF808910 */
  .extern DMASTATCLR       /* 0xBF808914 */
  .extern DMASTATSET       /* 0xBF808918 */
  .extern DMASTATINV       /* 0xBF80891C */
  .extern DMAADDR          /* 0xBF808920 */
  .extern DMAADDRCLR       /* 0xBF808924 */
  .extern DMAADDRSET       /* 0xBF808928 */
  .extern DMAADDRINV       /* 0xBF80892C */
  .extern DCRCCON          /* 0xBF808930 */
  .extern DCRCCONCLR       /* 0xBF808934 */
  .extern DCRCCONSET       /* 0xBF808938 */
  .extern DCRCCONINV       /* 0xBF80893C */
  .extern DCRCDATA         /* 0xBF808940 */
  .extern DCRCDATACLR      /* 0xBF808944 */
  .extern DCRCDATASET      /* 0xBF808948 */
  .extern DCRCDATAINV      /* 0xBF80894C */
  .extern DCRCXOR          /* 0xBF808950 */
  .extern DCRCXORCLR       /* 0xBF808954 */
  .extern DCRCXORSET       /* 0xBF808958 */
  .extern DCRCXORINV       /* 0xBF80895C */
  .extern DCH0CON          /* 0xBF808960 */
  .extern DCH0CONCLR       /* 0xBF808964 */
  .extern DCH0CONSET       /* 0xBF808968 */
  .extern DCH0CONINV       /* 0xBF80896C */
  .extern DCH0ECON         /* 0xBF808970 */
  .extern DCH0ECONCLR      /* 0xBF808974 */
  .extern DCH0ECONSET      /* 0xBF808978 */
  .extern DCH0ECONINV      /* 0xBF80897C */
  .extern DCH0INT          /* 0xBF808980 */
  .extern DCH0INTCLR       /* 0xBF808984 */
  .extern DCH0INTSET       /* 0xBF808988 */
  .extern DCH0INTINV       /* 0xBF80898C */
  .extern DCH0SSA          /* 0xBF808990 */
  .extern DCH0SSACLR       /* 0xBF808994 */
  .extern DCH0SSASET       /* 0xBF808998 */
  .extern DCH0SSAINV       /* 0xBF80899C */
  .extern DCH0DSA          /* 0xBF8089A0 */
  .extern DCH0DSACLR       /* 0xBF8089A4 */
  .extern DCH0DSASET       /* 0xBF8089A8 */
  .extern DCH0DSAINV       /* 0xBF8089AC */
  .extern DCH0SSIZ         /* 0xBF8089B0 */
  .extern DCH0SSIZCLR      /* 0xBF8089B4 */
  .extern DCH0SSIZSET      /* 0xBF8089B8 */
  .extern DCH0SSIZINV      /* 0xBF8089BC */
  .extern DCH0DSIZ         /* 0xBF8089C0 */
  .extern DCH0DSIZCLR      /* 0xBF8089C4 */
  .extern DCH0DSIZSET      /* 0xBF8089C8 */
  .extern DCH0DSIZINV      /* 0xBF8089CC */
  .extern DCH0SPTR         /* 0xBF8089D0 */
  .extern DCH0SPTRCLR      /* 0xBF8089D4 */
  .extern DCH0SPTRSET      /* 0xBF8089D8 */
  .extern DCH0SPTRINV      /* 0xBF8089DC */
  .extern DCH0DPTR         /* 0xBF8089E0 */
  .extern DCH0DPTRCLR      /* 0xBF8089E4 */
  .extern DCH0DPTRSET      /* 0xBF8089E8 */
  .extern DCH0DPTRINV      /* 0xBF8089EC */
  .extern DCH0CSIZ         /* 0xBF8089F0 */
  .extern DCH0CSIZCLR      /* 0xBF8089F4 */
  .extern DCH0CSIZSET      /* 0xBF8089F8 */
  .extern DCH0CSIZINV      /* 0xBF8089FC */
  .extern DCH0CPTR         /* 0xBF808A00 */
  .extern DCH0CPTRCLR      /* 0xBF808A04 */
  .extern DCH0CPTRSET      /* 0xBF808A08 */
  .extern DCH0CPTRINV      /* 0xBF808A0C */
  .extern DCH0DAT          /* 0xBF808A10 */
  .extern DCH0DATCLR       /* 0xBF808A14 */
  .extern DCH0DATSET       /* 0xBF808A18 */
  .extern DCH0DATINV       /* 0xBF808A1C */
  .extern DCH1CON          /* 0xBF808A20 */
  .extern DCH1CONCLR       /* 0xBF808A24 */
  .extern DCH1CONSET       /* 0xBF808A28 */
  .extern DCH1CONINV       /* 0xBF808A2C */
  .extern DCH1ECON         /* 0xBF808A30 */
  .extern DCH1ECONCLR      /* 0xBF808A34 */
  .extern DCH1ECONSET      /* 0xBF808A38 */
  .extern DCH1ECONINV      /* 0xBF808A3C */
  .extern DCH1INT          /* 0xBF808A40 */
  .extern DCH1INTCLR       /* 0xBF808A44 */
  .extern DCH1INTSET       /* 0xBF808A48 */
  .extern DCH1INTINV       /* 0xBF808A4C */
  .extern DCH1SSA          /* 0xBF808A50 */
  .extern DCH1SSACLR       /* 0xBF808A54 */
  .extern DCH1SSASET       /* 0xBF808A58 */
  .extern DCH1SSAINV       /* 0xBF808A5C */
  .extern DCH1DSA          /* 0xBF808A60 */
  .extern DCH1DSACLR       /* 0xBF808A64 */
  .extern DCH1DSASET       /* 0xBF808A68 */
  .extern DCH1DSAINV       /* 0xBF808A6C */
  .extern DCH1SSIZ         /* 0xBF808A70 */
  .extern DCH1SSIZCLR      /* 0xBF808A74 */
  .extern DCH1SSIZSET      /* 0xBF808A78 */
  .extern DCH1SSIZINV      /* 0xBF808A7C */
  .extern DCH1DSIZ         /* 0xBF808A80 */
  .extern DCH1DSIZCLR      /* 0xBF808A84 */
  .extern DCH1DSIZSET      /* 0xBF808A88 */
  .extern DCH1DSIZINV      /* 0xBF808A8C */
  .extern DCH1SPTR         /* 0xBF808A90 */
  .extern DCH1SPTRCLR      /* 0xBF808A94 */
  .extern DCH1SPTRSET      /* 0xBF808A98 */
  .extern DCH1SPTRINV      /* 0xBF808A9C */
  .extern DCH1DPTR         /* 0xBF808AA0 */
  .extern DCH1DPTRCLR      /* 0xBF808AA4 */
  .extern DCH1DPTRSET      /* 0xBF808AA8 */
  .extern DCH1DPTRINV      /* 0xBF808AAC */
  .extern DCH1CSIZ         /* 0xBF808AB0 */
  .extern DCH1CSIZCLR      /* 0xBF808AB4 */
  .extern DCH1CSIZSET      /* 0xBF808AB8 */
  .extern DCH1CSIZINV      /* 0xBF808ABC */
  .extern DCH1CPTR         /* 0xBF808AC0 */
  .extern DCH1CPTRCLR      /* 0xBF808AC4 */
  .extern DCH1CPTRSET      /* 0xBF808AC8 */
  .extern DCH1CPTRINV      /* 0xBF808ACC */
  .extern DCH1DAT          /* 0xBF808AD0 */
  .extern DCH1DATCLR       /* 0xBF808AD4 */
  .extern DCH1DATSET       /* 0xBF808AD8 */
  .extern DCH1DATINV       /* 0xBF808ADC */
  .extern DCH2CON          /* 0xBF808AE0 */
  .extern DCH2CONCLR       /* 0xBF808AE4 */
  .extern DCH2CONSET       /* 0xBF808AE8 */
  .extern DCH2CONINV       /* 0xBF808AEC */
  .extern DCH2ECON         /* 0xBF808AF0 */
  .extern DCH2ECONCLR      /* 0xBF808AF4 */
  .extern DCH2ECONSET      /* 0xBF808AF8 */
  .extern DCH2ECONINV      /* 0xBF808AFC */
  .extern DCH2INT          /* 0xBF808B00 */
  .extern DCH2INTCLR       /* 0xBF808B04 */
  .extern DCH2INTSET       /* 0xBF808B08 */
  .extern DCH2INTINV       /* 0xBF808B0C */
  .extern DCH2SSA          /* 0xBF808B10 */
  .extern DCH2SSACLR       /* 0xBF808B14 */
  .extern DCH2SSASET       /* 0xBF808B18 */
  .extern DCH2SSAINV       /* 0xBF808B1C */
  .extern DCH2DSA          /* 0xBF808B20 */
  .extern DCH2DSACLR       /* 0xBF808B24 */
  .extern DCH2DSASET       /* 0xBF808B28 */
  .extern DCH2DSAINV       /* 0xBF808B2C */
  .extern DCH2SSIZ         /* 0xBF808B30 */
  .extern DCH2SSIZCLR      /* 0xBF808B34 */
  .extern DCH2SSIZSET      /* 0xBF808B38 */
  .extern DCH2SSIZINV      /* 0xBF808B3C */
  .extern DCH2DSIZ         /* 0xBF808B40 */
  .extern DCH2DSIZCLR      /* 0xBF808B44 */
  .extern DCH2DSIZSET      /* 0xBF808B48 */
  .extern DCH2DSIZINV      /* 0xBF808B4C */
  .extern DCH2SPTR         /* 0xBF808B50 */
  .extern DCH2SPTRCLR      /* 0xBF808B54 */
  .extern DCH2SPTRSET      /* 0xBF808B58 */
  .extern DCH2SPTRINV      /* 0xBF808B5C */
  .extern DCH2DPTR         /* 0xBF808B60 */
  .extern DCH2DPTRCLR      /* 0xBF808B64 */
  .extern DCH2DPTRSET      /* 0xBF808B68 */
  .extern DCH2DPTRINV      /* 0xBF808B6C */
  .extern DCH2CSIZ         /* 0xBF808B70 */
  .extern DCH2CSIZCLR      /* 0xBF808B74 */
  .extern DCH2CSIZSET      /* 0xBF808B78 */
  .extern DCH2CSIZINV      /* 0xBF808B7C */
  .extern DCH2CPTR         /* 0xBF808B80 */
  .extern DCH2CPTRCLR      /* 0xBF808B84 */
  .extern DCH2CPTRSET      /* 0xBF808B88 */
  .extern DCH2CPTRINV      /* 0xBF808B8C */
  .extern DCH2DAT          /* 0xBF808B90 */
  .extern DCH2DATCLR       /* 0xBF808B94 */
  .extern DCH2DATSET       /* 0xBF808B98 */
  .extern DCH2DATINV       /* 0xBF808B9C */
  .extern DCH3CON          /* 0xBF808BA0 */
  .extern DCH3CONCLR       /* 0xBF808BA4 */
  .extern DCH3CONSET       /* 0xBF808BA8 */
  .extern DCH3CONINV       /* 0xBF808BAC */
  .extern DCH3ECON         /* 0xBF808BB0 */
  .extern DCH3ECONCLR      /* 0xBF808BB4 */
  .extern DCH3ECONSET      /* 0xBF808BB8 */
  .extern DCH3ECONINV      /* 0xBF808BBC */
  .extern DCH3INT          /* 0xBF808BC0 */
  .extern DCH3INTCLR       /* 0xBF808BC4 */
  .extern DCH3INTSET       /* 0xBF808BC8 */
  .extern DCH3INTINV       /* 0xBF808BCC */
  .extern DCH3SSA          /* 0xBF808BD0 */
  .extern DCH3SSACLR       /* 0xBF808BD4 */
  .extern DCH3SSASET       /* 0xBF808BD8 */
  .extern DCH3SSAINV       /* 0xBF808BDC */
  .extern DCH3DSA          /* 0xBF808BE0 */
  .extern DCH3DSACLR       /* 0xBF808BE4 */
  .extern DCH3DSASET       /* 0xBF808BE8 */
  .extern DCH3DSAINV       /* 0xBF808BEC */
  .extern DCH3SSIZ         /* 0xBF808BF0 */
  .extern DCH3SSIZCLR      /* 0xBF808BF4 */
  .extern DCH3SSIZSET      /* 0xBF808BF8 */
  .extern DCH3SSIZINV      /* 0xBF808BFC */
  .extern DCH3DSIZ         /* 0xBF808C00 */
  .extern DCH3DSIZCLR      /* 0xBF808C04 */
  .extern DCH3DSIZSET      /* 0xBF808C08 */
  .extern DCH3DSIZINV      /* 0xBF808C0C */
  .extern DCH3SPTR         /* 0xBF808C10 */
  .extern DCH3SPTRCLR      /* 0xBF808C14 */
  .extern DCH3SPTRSET      /* 0xBF808C18 */
  .extern DCH3SPTRINV      /* 0xBF808C1C */
  .extern DCH3DPTR         /* 0xBF808C20 */
  .extern DCH3DPTRCLR      /* 0xBF808C24 */
  .extern DCH3DPTRSET      /* 0xBF808C28 */
  .extern DCH3DPTRINV      /* 0xBF808C2C */
  .extern DCH3CSIZ         /* 0xBF808C30 */
  .extern DCH3CSIZCLR      /* 0xBF808C34 */
  .extern DCH3CSIZSET      /* 0xBF808C38 */
  .extern DCH3CSIZINV      /* 0xBF808C3C */
  .extern DCH3CPTR         /* 0xBF808C40 */
  .extern DCH3CPTRCLR      /* 0xBF808C44 */
  .extern DCH3CPTRSET      /* 0xBF808C48 */
  .extern DCH3CPTRINV      /* 0xBF808C4C */
  .extern DCH3DAT          /* 0xBF808C50 */
  .extern DCH3DATCLR       /* 0xBF808C54 */
  .extern DCH3DATSET       /* 0xBF808C58 */
  .extern DCH3DATINV       /* 0xBF808C5C */
  .extern INTCON           /* 0xBF80F000 */
  .extern INTCONCLR        /* 0xBF80F004 */
  .extern INTCONSET        /* 0xBF80F008 */
  .extern INTCONINV        /* 0xBF80F00C */
  .extern PRISS            /* 0xBF80F010 */
  .extern PRISSCLR         /* 0xBF80F014 */
  .extern PRISSSET         /* 0xBF80F018 */
  .extern PRISSINV         /* 0xBF80F01C */
  .extern INTSTAT          /* 0xBF80F020 */
  .extern INTSTATCLR       /* 0xBF80F024 */
  .extern INTSTATSET       /* 0xBF80F028 */
  .extern INTSTATINV       /* 0xBF80F02C */
  .extern IPTMR            /* 0xBF80F030 */
  .extern IPTMRCLR         /* 0xBF80F034 */
  .extern IPTMRSET         /* 0xBF80F038 */
  .extern IPTMRINV         /* 0xBF80F03C */
  .extern IFS0             /* 0xBF80F040 */
  .extern IFS0CLR          /* 0xBF80F044 */
  .extern IFS0SET          /* 0xBF80F048 */
  .extern IFS0INV          /* 0xBF80F04C */
  .extern IFS1             /* 0xBF80F050 */
  .extern IFS1CLR          /* 0xBF80F054 */
  .extern IFS1SET          /* 0xBF80F058 */
  .extern IFS1INV          /* 0xBF80F05C */
  .extern IFS2             /* 0xBF80F060 */
  .extern IFS2CLR          /* 0xBF80F064 */
  .extern IFS2SET          /* 0xBF80F068 */
  .extern IFS2INV          /* 0xBF80F06C */
  .extern IFS3             /* 0xBF80F070 */
  .extern IFS3CLR          /* 0xBF80F074 */
  .extern IFS3SET          /* 0xBF80F078 */
  .extern IFS3INV          /* 0xBF80F07C */
  .extern IEC0             /* 0xBF80F0C0 */
  .extern IEC0CLR          /* 0xBF80F0C4 */
  .extern IEC0SET          /* 0xBF80F0C8 */
  .extern IEC0INV          /* 0xBF80F0CC */
  .extern IEC1             /* 0xBF80F0D0 */
  .extern IEC1CLR          /* 0xBF80F0D4 */
  .extern IEC1SET          /* 0xBF80F0D8 */
  .extern IEC1INV          /* 0xBF80F0DC */
  .extern IEC2             /* 0xBF80F0E0 */
  .extern IEC2CLR          /* 0xBF80F0E4 */
  .extern IEC2SET          /* 0xBF80F0E8 */
  .extern IEC2INV          /* 0xBF80F0EC */
  .extern IEC3             /* 0xBF80F0F0 */
  .extern IEC3CLR          /* 0xBF80F0F4 */
  .extern IEC3SET          /* 0xBF80F0F8 */
  .extern IEC3INV          /* 0xBF80F0FC */
  .extern IPC0             /* 0xBF80F140 */
  .extern IPC0CLR          /* 0xBF80F144 */
  .extern IPC0SET          /* 0xBF80F148 */
  .extern IPC0INV          /* 0xBF80F14C */
  .extern IPC1             /* 0xBF80F150 */
  .extern IPC1CLR          /* 0xBF80F154 */
  .extern IPC1SET          /* 0xBF80F158 */
  .extern IPC1INV          /* 0xBF80F15C */
  .extern IPC2             /* 0xBF80F160 */
  .extern IPC2CLR          /* 0xBF80F164 */
  .extern IPC2SET          /* 0xBF80F168 */
  .extern IPC2INV          /* 0xBF80F16C */
  .extern IPC3             /* 0xBF80F170 */
  .extern IPC3CLR          /* 0xBF80F174 */
  .extern IPC3SET          /* 0xBF80F178 */
  .extern IPC3INV          /* 0xBF80F17C */
  .extern IPC4             /* 0xBF80F180 */
  .extern IPC4CLR          /* 0xBF80F184 */
  .extern IPC4SET          /* 0xBF80F188 */
  .extern IPC4INV          /* 0xBF80F18C */
  .extern IPC5             /* 0xBF80F190 */
  .extern IPC5CLR          /* 0xBF80F194 */
  .extern IPC5SET          /* 0xBF80F198 */
  .extern IPC5INV          /* 0xBF80F19C */
