Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM-GPM-0XX_DFP/1.3.50/include/proc/p32mm0064gpm064.h
#define _CNEN0D_CNIE0D1_POSITION                 0x00000001
#define _CNEN0D_CNIE0D1_MASK                     0x00000002
#define _CNEN0D_CNIE0D1_LENGTH                   0x00000001

#define _CNEN0D_CNIE0D2_POSITION                 0x00000002
#define _CNEN0D_CNIE0D2_MASK                     0x00000004
#define _CNEN0D_CNIE0D2_LENGTH                   0x00000001

#define _CNEN0D_CNIE0D3_POSITION                 0x00000003
#define _CNEN0D_CNIE0D3_MASK                     0x00000008
#define _CNEN0D_CNIE0D3_LENGTH                   0x00000001

#define _CNEN0D_CNIE0D4_POSITION                 0x00000004
#define _CNEN0D_CNIE0D4_MASK                     0x00000010
#define _CNEN0D_CNIE0D4_LENGTH                   0x00000001

#define _CNEN0D_w_POSITION                       0x00000000
#define _CNEN0D_w_MASK                           0xFFFFFFFF
#define _CNEN0D_w_LENGTH                         0x00000020

#define _CNSTATD_CNSTATD0_POSITION               0x00000000
#define _CNSTATD_CNSTATD0_MASK                   0x00000001
#define _CNSTATD_CNSTATD0_LENGTH                 0x00000001

#define _CNSTATD_CNSTATD1_POSITION               0x00000001
#define _CNSTATD_CNSTATD1_MASK                   0x00000002
#define _CNSTATD_CNSTATD1_LENGTH                 0x00000001

#define _CNSTATD_CNSTATD2_POSITION               0x00000002
#define _CNSTATD_CNSTATD2_MASK                   0x00000004
#define _CNSTATD_CNSTATD2_LENGTH                 0x00000001

#define _CNSTATD_CNSTATD3_POSITION               0x00000003
#define _CNSTATD_CNSTATD3_MASK                   0x00000008
#define _CNSTATD_CNSTATD3_LENGTH                 0x00000001

#define _CNSTATD_CNSTATD4_POSITION               0x00000004
#define _CNSTATD_CNSTATD4_MASK                   0x00000010
#define _CNSTATD_CNSTATD4_LENGTH                 0x00000001

#define _CNSTATD_w_POSITION                      0x00000000
#define _CNSTATD_w_MASK                          0xFFFFFFFF
#define _CNSTATD_w_LENGTH                        0x00000020

#define _CNEN1D_CNIE1D0_POSITION                 0x00000000
#define _CNEN1D_CNIE1D0_MASK                     0x00000001
#define _CNEN1D_CNIE1D0_LENGTH                   0x00000001

#define _CNEN1D_CNIE1D1_POSITION                 0x00000001
#define _CNEN1D_CNIE1D1_MASK                     0x00000002
#define _CNEN1D_CNIE1D1_LENGTH                   0x00000001

#define _CNEN1D_CNIE1D2_POSITION                 0x00000002
#define _CNEN1D_CNIE1D2_MASK                     0x00000004
#define _CNEN1D_CNIE1D2_LENGTH                   0x00000001

#define _CNEN1D_CNIE1D3_POSITION                 0x00000003
#define _CNEN1D_CNIE1D3_MASK                     0x00000008
#define _CNEN1D_CNIE1D3_LENGTH                   0x00000001

#define _CNEN1D_CNIE1D4_POSITION                 0x00000004
#define _CNEN1D_CNIE1D4_MASK                     0x00000010
#define _CNEN1D_CNIE1D4_LENGTH                   0x00000001

#define _CNEN1D_w_POSITION                       0x00000000
#define _CNEN1D_w_MASK                           0xFFFFFFFF
#define _CNEN1D_w_LENGTH                         0x00000020

#define _CNFD_CNFD0_POSITION                     0x00000000
#define _CNFD_CNFD0_MASK                         0x00000001
#define _CNFD_CNFD0_LENGTH                       0x00000001

#define _CNFD_CNFD1_POSITION                     0x00000001
#define _CNFD_CNFD1_MASK                         0x00000002
#define _CNFD_CNFD1_LENGTH                       0x00000001

#define _CNFD_CNFD2_POSITION                     0x00000002
#define _CNFD_CNFD2_MASK                         0x00000004
#define _CNFD_CNFD2_LENGTH                       0x00000001

#define _CNFD_CNFD3_POSITION                     0x00000003
#define _CNFD_CNFD3_MASK                         0x00000008
#define _CNFD_CNFD3_LENGTH                       0x00000001

#define _CNFD_CNFD4_POSITION                     0x00000004
#define _CNFD_CNFD4_MASK                         0x00000010
#define _CNFD_CNFD4_LENGTH                       0x00000001

#define _CNFD_w_POSITION                         0x00000000
#define _CNFD_w_MASK                             0xFFFFFFFF
#define _CNFD_w_LENGTH                           0x00000020

#define _SR0D_w_POSITION                         0x00000000
#define _SR0D_w_MASK                             0xFFFFFFFF
#define _SR0D_w_LENGTH                           0x00000020

#define _SR1D_w_POSITION                         0x00000000
#define _SR1D_w_MASK                             0xFFFFFFFF
#define _SR1D_w_LENGTH                           0x00000020

#define _PMDCON_PMDLOCK_POSITION                 0x0000000B
#define _PMDCON_PMDLOCK_MASK                     0x00000800
#define _PMDCON_PMDLOCK_LENGTH                   0x00000001

#define _PMD1_ADCMD_POSITION                     0x00000000
#define _PMD1_ADCMD_MASK                         0x00000001
#define _PMD1_ADCMD_LENGTH                       0x00000001

#define _PMD1_VREFMD_POSITION                    0x0000000C
#define _PMD1_VREFMD_MASK                        0x00001000
#define _PMD1_VREFMD_LENGTH                      0x00000001

#define _PMD1_HLVDMD_POSITION                    0x00000014
#define _PMD1_HLVDMD_MASK                        0x00100000
#define _PMD1_HLVDMD_LENGTH                      0x00000001

#define _PMD2_CMP1MD_POSITION                    0x00000000
#define _PMD2_CMP1MD_MASK                        0x00000001
#define _PMD2_CMP1MD_LENGTH                      0x00000001

#define _PMD2_CMP2MD_POSITION                    0x00000001
#define _PMD2_CMP2MD_MASK                        0x00000002
#define _PMD2_CMP2MD_LENGTH                      0x00000001

#define _PMD2_CMP3MD_POSITION                    0x00000002
#define _PMD2_CMP3MD_MASK                        0x00000004
#define _PMD2_CMP3MD_LENGTH                      0x00000001

#define _PMD2_CLC1MD_POSITION                    0x00000018
#define _PMD2_CLC1MD_MASK                        0x01000000
#define _PMD2_CLC1MD_LENGTH                      0x00000001

#define _PMD2_CLC2MD_POSITION                    0x00000019
#define _PMD2_CLC2MD_MASK                        0x02000000
#define _PMD2_CLC2MD_LENGTH                      0x00000001

#define _PMD2_CLC3MD_POSITION                    0x0000001A
#define _PMD2_CLC3MD_MASK                        0x04000000
#define _PMD2_CLC3MD_LENGTH                      0x00000001

#define _PMD2_CLC4MD_POSITION                    0x0000001B
#define _PMD2_CLC4MD_MASK                        0x08000000
#define _PMD2_CLC4MD_LENGTH                      0x00000001

