Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM-GPM-0XX_DFP/1.3.50/include/proc/p32mm0064gpm064.h
#define _FWDT_RWDTPS_POSITION                    0x00000008
#define _FWDT_RWDTPS_MASK                        0x00001F00
#define _FWDT_RWDTPS_LENGTH                      0x00000005

#define _FWDT_RCLKSEL_POSITION                   0x0000000D
#define _FWDT_RCLKSEL_MASK                       0x00006000
#define _FWDT_RCLKSEL_LENGTH                     0x00000002

#define _FWDT_FWDTEN_POSITION                    0x0000000F
#define _FWDT_FWDTEN_MASK                        0x00008000
#define _FWDT_FWDTEN_LENGTH                      0x00000001

#define _FWDT_w_POSITION                         0x00000000
#define _FWDT_w_MASK                             0xFFFFFFFF
#define _FWDT_w_LENGTH                           0x00000020

#define _FOSCSEL_FNOSC_POSITION                  0x00000000
#define _FOSCSEL_FNOSC_MASK                      0x00000007
#define _FOSCSEL_FNOSC_LENGTH                    0x00000003

#define _FOSCSEL_PLLSRC_POSITION                 0x00000004
#define _FOSCSEL_PLLSRC_MASK                     0x00000010
#define _FOSCSEL_PLLSRC_LENGTH                   0x00000001

#define _FOSCSEL_SOSCEN_POSITION                 0x00000006
#define _FOSCSEL_SOSCEN_MASK                     0x00000040
#define _FOSCSEL_SOSCEN_LENGTH                   0x00000001

#define _FOSCSEL_IESO_POSITION                   0x00000007
#define _FOSCSEL_IESO_MASK                       0x00000080
#define _FOSCSEL_IESO_LENGTH                     0x00000001

#define _FOSCSEL_POSCMOD_POSITION                0x00000008
#define _FOSCSEL_POSCMOD_MASK                    0x00000300
#define _FOSCSEL_POSCMOD_LENGTH                  0x00000002

#define _FOSCSEL_OSCIOFNC_POSITION               0x0000000A
#define _FOSCSEL_OSCIOFNC_MASK                   0x00000400
#define _FOSCSEL_OSCIOFNC_LENGTH                 0x00000001

#define _FOSCSEL_SOSCSEL_POSITION                0x0000000C
#define _FOSCSEL_SOSCSEL_MASK                    0x00001000
#define _FOSCSEL_SOSCSEL_LENGTH                  0x00000001

#define _FOSCSEL_FCKSM_POSITION                  0x0000000E
#define _FOSCSEL_FCKSM_MASK                      0x0000C000
#define _FOSCSEL_FCKSM_LENGTH                    0x00000002

#define _FOSCSEL_w_POSITION                      0x00000000
#define _FOSCSEL_w_MASK                          0xFFFFFFFF
#define _FOSCSEL_w_LENGTH                        0x00000020

#define _FSEC_CP_POSITION                        0x0000001F
#define _FSEC_CP_MASK                            0x80000000
#define _FSEC_CP_LENGTH                          0x00000001

#define _FSEC_w_POSITION                         0x00000000
#define _FSEC_w_MASK                             0xFFFFFFFF
#define _FSEC_w_LENGTH                           0x00000020

#define _AFDEVOPT_SOSCHP_POSITION                0x00000003
#define _AFDEVOPT_SOSCHP_MASK                    0x00000008
#define _AFDEVOPT_SOSCHP_LENGTH                  0x00000001

#define _AFDEVOPT_ALTI2C_POSITION                0x00000004
#define _AFDEVOPT_ALTI2C_MASK                    0x00000010
#define _AFDEVOPT_ALTI2C_LENGTH                  0x00000001

#define _AFDEVOPT_FUSBIDIO_POSITION              0x0000000E
#define _AFDEVOPT_FUSBIDIO_MASK                  0x00004000
#define _AFDEVOPT_FUSBIDIO_LENGTH                0x00000001

#define _AFDEVOPT_FVBUSIO_POSITION               0x0000000F
#define _AFDEVOPT_FVBUSIO_MASK                   0x00008000
#define _AFDEVOPT_FVBUSIO_LENGTH                 0x00000001

#define _AFDEVOPT_USERID_POSITION                0x00000010
#define _AFDEVOPT_USERID_MASK                    0xFFFF0000
#define _AFDEVOPT_USERID_LENGTH                  0x00000010

#define _AFDEVOPT_w_POSITION                     0x00000000
#define _AFDEVOPT_w_MASK                         0xFFFFFFFF
#define _AFDEVOPT_w_LENGTH                       0x00000020

#define _AFICD_JTAGEN_POSITION                   0x00000002
#define _AFICD_JTAGEN_MASK                       0x00000004
#define _AFICD_JTAGEN_LENGTH                     0x00000001

#define _AFICD_ICS_POSITION                      0x00000003
#define _AFICD_ICS_MASK                          0x00000018
#define _AFICD_ICS_LENGTH                        0x00000002

#define _AFICD_w_POSITION                        0x00000000
#define _AFICD_w_MASK                            0xFFFFFFFF
#define _AFICD_w_LENGTH                          0x00000020

#define _AFPOR_BOREN_POSITION                    0x00000000
#define _AFPOR_BOREN_MASK                        0x00000003
#define _AFPOR_BOREN_LENGTH                      0x00000002

#define _AFPOR_RETVR_POSITION                    0x00000002
#define _AFPOR_RETVR_MASK                        0x00000004
#define _AFPOR_RETVR_LENGTH                      0x00000001

#define _AFPOR_LPBOREN_POSITION                  0x00000003
#define _AFPOR_LPBOREN_MASK                      0x00000008
#define _AFPOR_LPBOREN_LENGTH                    0x00000001

#define _AFPOR_w_POSITION                        0x00000000
#define _AFPOR_w_MASK                            0xFFFFFFFF
#define _AFPOR_w_LENGTH                          0x00000020

#define _AFWDT_SWDTPS_POSITION                   0x00000000
#define _AFWDT_SWDTPS_MASK                       0x0000001F
#define _AFWDT_SWDTPS_LENGTH                     0x00000005

#define _AFWDT_FWDTWINSZ_POSITION                0x00000005
#define _AFWDT_FWDTWINSZ_MASK                    0x00000060
#define _AFWDT_FWDTWINSZ_LENGTH                  0x00000002

#define _AFWDT_WINDIS_POSITION                   0x00000007
#define _AFWDT_WINDIS_MASK                       0x00000080
#define _AFWDT_WINDIS_LENGTH                     0x00000001

#define _AFWDT_RWDTPS_POSITION                   0x00000008
#define _AFWDT_RWDTPS_MASK                       0x00001F00
#define _AFWDT_RWDTPS_LENGTH                     0x00000005

#define _AFWDT_RCLKSEL_POSITION                  0x0000000D
#define _AFWDT_RCLKSEL_MASK                      0x00006000
#define _AFWDT_RCLKSEL_LENGTH                    0x00000002

#define _AFWDT_FWDTEN_POSITION                   0x0000000F
#define _AFWDT_FWDTEN_MASK                       0x00008000
#define _AFWDT_FWDTEN_LENGTH                     0x00000001

#define _AFWDT_w_POSITION                        0x00000000
#define _AFWDT_w_MASK                            0xFFFFFFFF
#define _AFWDT_w_LENGTH                          0x00000020

#define _AFOSCSEL_FNOSC_POSITION                 0x00000000
#define _AFOSCSEL_FNOSC_MASK                     0x00000007
#define _AFOSCSEL_FNOSC_LENGTH                   0x00000003

#define _AFOSCSEL_PLLSRC_POSITION                0x00000004
#define _AFOSCSEL_PLLSRC_MASK                    0x00000010
#define _AFOSCSEL_PLLSRC_LENGTH                  0x00000001

#define _AFOSCSEL_SOSCEN_POSITION                0x00000006
#define _AFOSCSEL_SOSCEN_MASK                    0x00000040
#define _AFOSCSEL_SOSCEN_LENGTH                  0x00000001

